Diary/app/controllers/tasks_controller.rb

  def index

    #breakpoint
    #print "HERE"
    @tasks = Task.find(:all, :conditions => [ "category_id=?", 3 ] )
---
SELECT * FROM "tasks" WHERE ("tasks"."category_id" = 3) ORDER BY tasks.id DESC LIMIT 1